___

<a href='http://www.pieriandata.com'><img src='../Pierian_Data_Logo.png'/></a>
___
<center><em>Copyright Pierian Data</em></center>
<center><em>For more information, visit us at <a href='http://www.pieriandata.com'>www.pieriandata.com</a></em></center>

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions.
You call a categorical column to groupby based on it, but what happens in the backend?
- it splits the data up into groups
- it applies a aggregate function. aggregate function: take multiple values and return 1 value. it applies the aggregate function for all numerical columns of the table.
- reunite the dataset again.

In [13]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350],
       'employee_no':[10,12,20,25,54,50]}

In [14]:
df = pd.DataFrame(data)

In [15]:
df

  Company   Person  Sales  employee_no
0    GOOG      Sam    200           10
1    GOOG  Charlie    120           12
2    MSFT      Amy    340           20
3    MSFT  Vanessa    124           25
4      FB     Carl    243           54
5      FB    Sarah    350           50

<strong>Now you can use the .groupby() method to group rows together based off of a column name.<br>For instance let's group based off of Company. This will create a DataFrameGroupBy object:</strong>

In [5]:
df.groupby('Company')

You can save this object as a new variable:

In [6]:
by_comp = df.groupby("Company")

And then call aggregate methods off the object:

In [7]:
by_comp.mean()

         Sales  employee_no
Company
FB       296.5         52.0
GOOG     160.0         11.0
MSFT     232.0         22.5

In [8]:
df.groupby('Company').mean()

         Sales  employee_no
Company
FB       296.5         52.0
GOOG     160.0         11.0
MSFT     232.0         22.5

More examples of aggregate methods:

In [9]:
by_comp.std()

              Sales  employee_no
Company
FB        75.660426     2.828427
GOOG      56.568542     1.414214
MSFT     152.735065     3.535534

In [16]:
df

  Company   Person  Sales  employee_no
0    GOOG      Sam    200           10
1    GOOG  Charlie    120           12
2    MSFT      Amy    340           20
3    MSFT  Vanessa    124           25
4      FB     Carl    243           54
5      FB    Sarah    350           50

In [21]:
by_comp.min()
# it applies min() to each column indepemdently. For categorical columns, it applies min() based on alphabet

          Person  Sales  employee_no
Company
FB          Carl    243           50
GOOG     Charlie    120           10
MSFT         Amy    124           20

In [18]:
by_comp.max()

          Person  Sales  employee_no
Company
FB         Sarah    350           54
GOOG         Sam    200           12
MSFT     Vanessa    340           25

In [19]:
by_comp.count()

         Person  Sales  employee_no
Company
FB            2      2            2
GOOG          2      2            2
MSFT          2      2            2

In [20]:
by_comp.describe()

        Sales                                                          \
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

        employee_no
              count  mean       std   min    25%   50%    75%   max
Company
FB              2.0  52.0  2.828427  50.0  51.00  52.0  53.00  54.0
GOOG            2.0  11.0  1.414214  10.0  10.50  11.0  11.50  12.0
MSFT            2.0  22.5  3.535534  20.0  21.25  22.5  23.75  25.0

In [43]:
by_comp.describe().transpose()

Company    FB                                                         GOOG  \
        count   mean        std    min     25%    50%     75%    max count
Sales     2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0   2.0

Company         ...                  MSFT                                   \
          mean  ...      75%    max count   mean         std    min    25%
Sales    160.0  ...    180.0  200.0   2.0  232.0  152.735065  124.0  178.0

Company
           50%    75%    max
Sales    232.0  286.0  340.0

[1 rows x 24 columns]

In [44]:
by_comp.describe().transpose()['GOOG']

       count   mean        std    min    25%    50%    75%    max
Sales    2.0  160.0  56.568542  120.0  140.0  160.0  180.0  200.0

# Great Job!